<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# SQL Data Analysis: Population by Type of Disability

## 1.0 Connecting to our Database

In [1]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

## 1.1 Importing Data from CSV files

In [2]:
# Importing the pandas library
# We will use a function read_csv from pandas to read our datasets as shown
#
import pandas as pd

In [3]:
# Loading our table from the respective CSV files
# We will export the dataset that we have cleaned using python
#
with open('./datasets/disability.csv','r') as f:
    Population = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Population;
%sql PERSIST Population;
%sql SELECT * FROM Population LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 709, 182, 2012, 169, 65, 247, 807, 3529, 709, 6512, 7720, 'Baringo'),
 (1, 0, 0, 1909, 653, 529, 529, 928, 19, 2530, 6538, 7097, 'Bomet'),
 (2, 1619, 0, 6479, 0, 302, 2739, 1672, 0, 2884, 13170, 14076, 'Bungoma'),
 (3, 0, 0, 951, 818, 306, 2362, 319, 985, 2089, 6655, 7830, 'Busia'),
 (4, 0, 0, 1141, 0, 1285, 0, 719, 453, 266, 3599, 3864, 'Elgeyo Marakwet')]

## 1.2 Previewing our Dataset

In [4]:
# Let's preview the first 10 rows of our data
# 

%sql SELECT * FROM Population LIMIT 10;

 * sqlite://
Done.

[(0, 709, 182, 2012, 169, 65, 247, 807, 3529, 709, 6512, 7720, 'Baringo'),
 (1, 0, 0, 1909, 653, 529, 529, 928, 19, 2530, 6538, 7097, 'Bomet'),
 (2, 1619, 0, 6479, 0, 302, 2739, 1672, 0, 2884, 13170, 14076, 'Bungoma'),
 (3, 0, 0, 951, 818, 306, 2362, 319, 985, 2089, 6655, 7830, 'Busia'),
 (4, 0, 0, 1141, 0, 1285, 0, 719, 453, 266, 3599, 3864, 'Elgeyo Marakwet'),
 (5, 0, 0, 3464, 0, 0, 188, 188, 157, 2628, 6287, 6625, 'Embu'),
 (6, 0, 691, 0, 0, 0, 0, 210, 210, 961, 1864, 2072, 'Garissa'),
 (7, 497, 0, 4952, 1587, 1492, 1232, 2677, 2132, 11445, 23696, 25517, 'Homa Bay'),
 (8, 299, 71, 702, 831, 277, 0, 0, 43, 426, 2154, 2350, 'Isiolo'),
 (9, 0, 0, 874, 617, 0, 0, 897, 0, 1478, 3250, 3866, 'Kajiado')]

## 1.3 Accessing Information about our Dataset

In [5]:
# Getting to know more about the dataset by accessing its information
#
%sql PRAGMA table_info(Population)

 * sqlite://
Done.

[(0, 'index', 'BIGINT', 0, None, 0),
 (1, 'Missing_Hand', 'BIGINT', 0, None, 0),
 (2, 'Missing_Foot', 'BIGINT', 0, None, 0),
 (3, 'Lame', 'BIGINT', 0, None, 0),
 (4, 'Blind', 'BIGINT', 0, None, 0),
 (5, 'Deaf', 'BIGINT', 0, None, 0),
 (6, 'Dumb', 'BIGINT', 0, None, 0),
 (7, 'Mental', 'BIGINT', 0, None, 0),
 (8, 'Paralyzed', 'BIGINT', 0, None, 0),
 (9, 'Other', 'BIGINT', 0, None, 0),
 (10, 'Total_Count', 'BIGINT', 0, None, 0),
 (11, 'Total_Cases', 'BIGINT', 0, None, 0),
 (12, 'County', 'TEXT', 0, None, 0)]

In [6]:
%sql DELETE FROM Population WHERE `County` = 'Kenya average';

 * sqlite://
1 rows affected.

[]

## 1.5 Answering Questions

Let's answer the following questions with our dataset. These are the same questions we answered using the python programming language.

In [7]:
# Challenge 1
# Which county had the highest no. of registered deaf persons?
# 
%sql select `County`, MAX(`Deaf`) FROM Population;

 * sqlite://
Done.

[('Vihiga', 2983)]

In [8]:
# Challenge 2
# Which county had the highest no. of registered persons with a missing hand?
#
%sql select `County`, MAX(`Missing_Hand`) FROM Population;

 * sqlite://
Done.

[('Bungoma', 1619)]

In [9]:
# Challenge 3
# Which county had the highest no. of registered persons with a missing foot?
# 
%sql select `County`, MAX(`Missing_Foot`) FROM Population;

 * sqlite://
Done.

[('Nairobi', 1881)]

In [10]:
# Challenge 4
# Which county had the highest no. of registered lame persons?
# 
%sql select `County`, MAX(`Lame`) FROM Population;

 * sqlite://
Done.

[('Nakuru', 11878)]

In [11]:
# Challenge 5
# Which county had the lowest no. of registered blind persons?
# 
%sql select `County`, `Blind` FROM Population WHERE `Blind` IN (SELECT MIN(`Blind`) FROM Population );

 * sqlite://
Done.

[('Bungoma', 0),
 ('Elgeyo Marakwet', 0),
 ('Embu', 0),
 ('Garissa', 0),
 ('Kirinyaga', 0),
 ('Kisumu', 0),
 ('Laikipia', 0),
 ('Lamu', 0),
 ('Machakos', 0),
 ('Meru', 0),
 ("Murang'a", 0),
 ('Nairobi', 0),
 ('Nakuru', 0),
 ('Nyamira', 0),
 ('Nyandarua', 0),
 ('Taita Taveta', 0),
 ('Tharaka Nithi', 0),
 ('Uasin Gishu', 0)]

In [12]:
# Challenge 6
# Which county had the highest third no. of registered deaf persons?
# 
%sql CREATE TABLE `Deaf_Query` as SELECT `County`, `Deaf` FROM Population ORDER BY `Deaf` DESC LIMIT 3;
%sql SELECT `County`, MIN(`Deaf`) as `3rd Most Deaf` FROM `Deaf_Query`;

 * sqlite://
Done.
 * sqlite://
Done.

[('Nyamira', 2373)]

In [13]:
#Challenge 6 Extension 
#Drop the created `Deaf_Query` table, used to solve challenge 6
%sql DROP TABLE `Deaf_Query`;

 * sqlite://
Done.

[]

In [14]:
# Challenge 7
# In descending order, which top 5 counties had the highest no. of registered dumb persons?
# 
%sql SELECT `County`, `Dumb` FROM Population ORDER BY `Dumb` DESC LIMIT 5;

 * sqlite://
Done.

[("Murang'a", 3524),
 ('Bungoma', 2739),
 ('Nyamira', 2576),
 ('Machakos', 2416),
 ('Busia', 2362)]

In [15]:
# Challenge 8
# In ascending order, which top 5 counties had the highest no. of registered persons with a mental disability? 
# 
%sql CREATE TABLE `Mental_Query` AS SELECT `County`, `Mental` FROM Population ORDER BY `Mental` DESC LIMIT 5;
%sql SELECT `County`, `Mental` FROM `Mental_Query` ORDER BY `Mental` ASC;

 * sqlite://
Done.
 * sqlite://
Done.

[('Kwale', 4294),
 ('Machakos', 4410),
 ('Nairobi', 4421),
 ('Kiambu', 7140),
 ('Nakuru', 7256)]

In [16]:
#Challenge 8 Extension 
#Drop the created `Mental_Query` table, used to solve challenge 8
%sql DROP TABLE `Mental_Query`;

 * sqlite://
Done.

[]

In [17]:
# Challenge 9
# Which counties had no registerd blind persons nor deaf persons?
# 
%sql SELECT `County`, `Blind` FROM Population WHERE `Blind` == 0 and `Deaf` == 0;

 * sqlite://
Done.

[('Embu', 0),
 ('Garissa', 0),
 ('Kirinyaga', 0),
 ('Kisumu', 0),
 ('Laikipia', 0),
 ('Lamu', 0),
 ('Machakos', 0),
 ('Meru', 0),
 ('Nakuru', 0),
 ('Taita Taveta', 0),
 ('Uasin Gishu', 0)]

In [24]:
# Challenge 10
# Which disability was the most registered across all the counties?
# 
%sql SELECT * FROM Population;

 * sqlite://
Done.

[(0, 709, 182, 2012, 169, 65, 247, 807, 3529, 709, 6512, 7720, 'Baringo'),
 (1, 0, 0, 1909, 653, 529, 529, 928, 19, 2530, 6538, 7097, 'Bomet'),
 (2, 1619, 0, 6479, 0, 302, 2739, 1672, 0, 2884, 13170, 14076, 'Bungoma'),
 (3, 0, 0, 951, 818, 306, 2362, 319, 985, 2089, 6655, 7830, 'Busia'),
 (4, 0, 0, 1141, 0, 1285, 0, 719, 453, 266, 3599, 3864, 'Elgeyo Marakwet'),
 (5, 0, 0, 3464, 0, 0, 188, 188, 157, 2628, 6287, 6625, 'Embu'),
 (6, 0, 691, 0, 0, 0, 0, 210, 210, 961, 1864, 2072, 'Garissa'),
 (7, 497, 0, 4952, 1587, 1492, 1232, 2677, 2132, 11445, 23696, 25517, 'Homa Bay'),
 (8, 299, 71, 702, 831, 277, 0, 0, 43, 426, 2154, 2350, 'Isiolo'),
 (9, 0, 0, 874, 617, 0, 0, 897, 0, 1478, 3250, 3866, 'Kajiado'),
 (10, 274, 0, 8268, 1867, 137, 1318, 988, 1730, 14201, 27468, 28509, 'Kakamega'),
 (11, 0, 0, 0, 146, 0, 0, 0, 663, 2249, 3055, 3058, 'Kericho'),
 (12, 0, 0, 0, 1020, 0, 0, 7140, 767, 1171, 10099, 10098, 'Kiambu'),
 (13, 174, 0, 2483, 1273, 965, 496, 2050, 692, 174, 6996, 8133, 'Kilifi'),
 (14, 0, 0, 105, 0, 0, 0, 1675, 847, 0, 2522, 2627, 'Kirinyaga'),
 (15, 0, 635, 673, 1222, 982, 635, 2127, 1059, 2291, 9627, 9624, 'Kisii'),
 (16, 1521, 0, 6548, 0, 0, 901, 3544, 600, 8290, 20026, 19883, 'Kisumu'),
 (17, 0, 409, 484, 757, 0, 1602, 779, 854, 334, 4403, 5219, 'Kitui'),
 (18, 0, 773, 1241, 629, 0, 1692, 4294, 544, 1658, 8503, 10831, 'Kwale'),
 (19, 0, 0, 825, 0, 0, 1000, 0, 0, 0, 1825, 1825, 'Laikipia'),
 (20, 0, 0, 0, 0, 0, 136, 45, 15, 342, 524, 538, 'Lamu'),
 (21, 0, 0, 2956, 0, 0, 2416, 4410, 4222, 13818, 23460, 27822, 'Machakos'),
 (22, 0, 0, 2584, 4874, 727, 1423, 3048, 1686, 4719, 15475, 19061, 'Makueni'),
 (23, 0, 46, 297, 468, 865, 394, 989, 307, 364, 3343, 3730, 'Mandera'),
 (24, 58, 381, 636, 338, 739, 377, 456, 939, 719, 3931, 4585, 'Marsabit'),
 (25, 0, 0, 6650, 0, 0, 2223, 2357, 766, 10963, 19166, 22959, 'Meru'),
 (26, 921, 1059, 4515, 215, 614, 0, 1320, 2365, 4623, 15359, 14711, 'Migori'),
 (27, 0, 0, 503, 1326, 0, 54, 909, 1396, 1223, 5413, 5411, 'Mombasa'),
 (28, 0, 0, 1404, 0, 1464, 3524, 1727, 859, 1319, 8512, 10297, "Murang'a"),
 (29, 0, 1881, 3046, 0, 2613, 1135, 4421, 164, 2822, 14936, 16082, 'Nairobi'),
 (30, 86, 0, 11878, 0, 0, 1814, 7256, 2742, 3390, 21598, 27080, 'Nakuru'),
 (31, 0, 1049, 2963, 807, 1049, 0, 0, 0, 5661, 11530, 11529, 'Nandi'),
 (32, 431, 47, 902, 199, 974, 1780, 1892, 2595, 1149, 7986, 9538, 'Narok'),
 (33, 0, 0, 997, 0, 2373, 2576, 0, 0, 0, 4727, 5946, 'Nyamira'),
 (34, 502, 0, 680, 0, 661, 0, 526, 0, 0, 2369, 1867, 'Nyandarua'),
 (35, 0, 385, 985, 385, 600, 234, 787, 0, 0, 2392, 3376, 'Nyeri'),
 (36, 298, 257, 813, 566, 265, 187, 182, 0, 0, 2574, 2270, 'Samburu'),
 (37, 0, 0, 1406, 1846, 0, 357, 910, 627, 1481, 6279, 6627, 'Siaya'),
 (38, 0, 137, 571, 0, 0, 493, 3082, 756, 218, 3709, 5257, 'Taita Taveta'),
 (39, 0, 0, 1587, 784, 599, 270, 1206, 340, 299, 3699, 5085, 'Tana River'),
 (40, 0, 0, 0, 0, 123, 123, 173, 0, 123, 420, 542, 'Tharaka Nithi'),
 (41, 0, 0, 0, 932, 0, 0, 1691, 0, 5627, 8251, 8250, 'Trans Nzoia'),
 (42, 0, 0, 0, 615, 135, 0, 0, 1597, 0, 1733, 2347, 'Turkana'),
 (43, 0, 0, 1726, 0, 0, 0, 2533, 668, 5392, 9281, 10319, 'Uasin Gishu'),
 (44, 0, 0, 7094, 4627, 2983, 258, 1879, 0, 6318, 23490, 23159, 'Vihiga'),
 (45, 120, 482, 4684, 742, 742, 1651, 1178, 1465, 0, 9276, 10944, 'Wajir'),
 (46, 0, 682, 1437, 1028, 0, 0, 0, 1506, 614, 4874, 5267, 'West Pokot')]

In [23]:
%sql CREATE TABLE tot AS SELECT MAX(SUM(`Missing_Hand`) AS `Missing_Hand`, SUM(`Missing_Foot`) AS `Missing_Foot`, SUM(`Lame`) AS `Lame`, SUM(`Blind`), SUM(`Deaf`), SUM(`Dumb`), SUM(`Mental`), SUM(`Paralyzed`)) FROM Population;
%sql

 * sqlite://
(sqlite3.OperationalError) table tot already exists
[SQL: CREATE TABLE tot AS SELECT MAX(SUM(`Missing_Hand`), SUM(`Missing_Foot`), SUM(`Lame`), SUM(`Blind`), SUM(`Deaf`), SUM(`Dumb`), SUM(`Mental`), SUM(`Paralyzed`)) FROM Population;]
(Background on this error at: http://sqlalche.me/e/e3q8)
 * sqlite://
Done.

[(7509, 9167, 103425, 31341, 23866, 36366, 73991, 40299)]

In [0]:
# Challenge 11
# Which disability was the least registered across all the counties?
#
OUR CODE GOES HERE

In [0]:
# Challenge 12
# What was the average no. of registered persons with a disability?
#

In [90]:
# Challenge 13
# Which three counties had least registered persons with disabilities?
#
%sql SELECT `County`, `Total_Count` FROM Population ORDER BY `Total_Count` ASC LIMIT 3;

 * sqlite://
Done.

[('Tharaka Nithi', 420), ('Lamu', 524), ('Turkana', 1733)]

In [95]:
# Challenge 14
# What was the total no of registered persons with a disability across all counties?
#
%sql SELECT SUM(`Total_Count`) FROM Population;

 * sqlite://
Done.

[(402556,)]

In [94]:
# Challenge 15 
# Which top 3 counties has the highest no. of registered persons with a disability?
# 
%sql SELECT `County`, `Total_Count` FROM Population ORDER BY `Total_Count` DESC LIMIT 3;

 * sqlite://
Done.

[('Kakamega', 27468), ('Homa Bay', 23696), ('Vihiga', 23490)]

<h3>Question To Review: </h3>6,